## The pandas Library

#### dataframe을 사용한다. <br> 행과 열로 이루어진 데이터 ex) 엑셀, 데이터베이스의 필드나 레코드 <br>현재 IT산업에서 데이터 조작(빅데이터, 주가 예측)에서 많이 사용된다.

In [4]:
!pip install pandas 
import pandas as pd

Requirement already satisfied: pandas in c:\users\goeun\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\goeun\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\goeun\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\goeun\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\goeun\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [9]:
#test dictionary를 하나 만든다
#3개의 성적을 갖고있음 (3개의 열) , (key 는 col 의 이름)
test_dict = {'Corey':[63,75,88],'Kevin':[48,98,92],'Akshay':[87,86,85]}

In [10]:
#만든 dictionary를 dataFrame으로 변경
df = pd.DataFrame(test_dict)

In [11]:
df #dataFrame 을 출력

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [12]:
#Transpose DataFrame 행과 열을 바꿔준다
df = df.T
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [13]:
#rename columns col 이름을 바꾼다
df.columns=['Quiz_1','Quiz_2','Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [14]:
df.iloc[0]  #1번째 행을 출력

Quiz_1    63
Quiz_2    75
Quiz_3    88
Name: Corey, dtype: int64

In [15]:
df.iloc[1]

Quiz_1    48
Quiz_2    98
Quiz_3    92
Name: Kevin, dtype: int64

In [15]:
#slice 
df.iloc[0,:]

Quiz_1    63
Quiz_2    75
Quiz_3    88
Name: Corey, dtype: int64

In [16]:
#col의 이름으로 접근  
df['Quiz_1'] #첫번째 col

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

In [17]:
df.Quiz_1 #첫번째 col

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

In [18]:
df.iloc[:,0] #첫번쨰 col

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

## Computing DataFrames within DataFrames

In [16]:
rows= ['Corey','Kevin']
cols=['Quiz_2','Quiz_3']
df_spring = df.loc[rows,cols] #df.iloc 은 숫자가 들어가야함 아니면 loc
df_spring

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [17]:
df.iloc[[0,1],[1,2]] #df.loc[rows,cols]와 같음

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [18]:
df.iloc[0:2,1:3] #slice로 위의 결과와 같음

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [19]:
df['Quiz_Avg']=df.mean(axis=1) #행별 평균을 낸다 
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg
Corey       63      75      88  75.333333
Kevin       48      98      92  79.333333
Akshay      87      86      85  86.000000

In [20]:
df['Quiz_4']=[92,95,88]
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4
Corey       63      75      88  75.333333      92
Kevin       48      98      92  79.333333      95
Akshay      87      86      85  86.000000      88

In [37]:
df2 = df.mean(axis=0)
df2

Quiz_1    66.000000
Quiz_2    86.333333
Quiz_3    88.333333
Quiz_4    91.666667
dtype: float64

In [21]:
del df['Quiz_Avg']
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

#### Null Value <br> NaN : Not a Number (numpy 특수 data형태) 비어있거나 없거나 모르는 값은 NaN으로 사용한다

In [22]:
import numpy as np
df_new = pd.DataFrame({'Quiz_1':[np.NaN],'Quiz_2':[np.NaN],'Quiz_3':[np.NaN],'Quiz_4':[71]},index=['Adrian'])
df_new

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Adrian     NaN     NaN     NaN      71

In [23]:
df = pd.concat([df,df_new])
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey     63.0    75.0    88.0      92
Kevin     48.0    98.0    92.0      95
Akshay    87.0    86.0    85.0      88
Adrian     NaN     NaN     NaN      71

In [24]:
df['Quiz_Avg']=df.mean(axis=1,skipna=True) #skipna=false이면 adrian행이 계산X
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey     63.0    75.0    88.0      92     79.50
Kevin     48.0    98.0    92.0      95     83.25
Akshay    87.0    86.0    85.0      88     86.50
Adrian     NaN     NaN     NaN      71     71.00

In [25]:
df.Quiz_4.astype(float) #astype을 사용하여 자료형을 바꿀 수 있다

Corey     92.0
Kevin     95.0
Akshay    88.0
Adrian    71.0
Name: Quiz_4, dtype: float64

## csv file

In [28]:
import pandas as pd
df = pd.read_csv("weather_data.csv")
df

   Unnamed:       day  temperature  windspeed  event
0         0  7/1/2021           32          6   Rain
1         1  7/2/2021           35          7  Sunny
2         2  7/3/2021           28          2   Snow
3         3  7/4/2021           24          7   Snow
4         4  7/5/2021           32          4   Rain
5         5  7/6/2021           31          2  Sunny

In [29]:
df['temperature'].max()

35

In [31]:
df['day'][df['event']=='Rain'] #event가 비온날의 day가 출력

0    7/1/2021
4    7/5/2021
Name: day, dtype: object

In [32]:
df['windspeed'].mean()

4.666666666666667

#### list of tuples

In [35]:
weather_data = [('7/1/2021',32,6,'Rain'),
('7/2/2021',35,7,'Sunny'),
('7/3/2021',28,2,'Snow'),
('7/4/2021',24,7,'Snow'),
('7/5/2021',32,4,'Rain'),
('7/6/2021',31,2,'Sunny')
]
df= pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  7/1/2021           32          6   Rain
1  7/2/2021           35          7  Sunny
2  7/3/2021           28          2   Snow
3  7/4/2021           24          7   Snow
4  7/5/2021           32          4   Rain
5  7/6/2021           31          2  Sunny

In [37]:
df.shape

(6, 4)

In [38]:
df.head(3)

        day  temperature  windspeed  event
0  7/1/2021           32          6   Rain
1  7/2/2021           35          7  Sunny
2  7/3/2021           28          2   Snow

In [39]:
df.tail(3)

        day  temperature  windspeed  event
3  7/4/2021           24          7   Snow
4  7/5/2021           32          4   Rain
5  7/6/2021           31          2  Sunny

In [40]:
df[2:5]

        day  temperature  windspeed event
2  7/3/2021           28          2  Snow
3  7/4/2021           24          7  Snow
4  7/5/2021           32          4  Rain

In [41]:
df[['day','event']]

        day  event
0  7/1/2021   Rain
1  7/2/2021  Sunny
2  7/3/2021   Snow
3  7/4/2021   Snow
4  7/5/2021   Rain
5  7/6/2021  Sunny

In [44]:
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [45]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  7/2/2021           35          7  Sunny

In [47]:
df.to_csv("weater_data.csv",index=False)

pd.read_csv('filename')<br>
_excel<br>
_feather<br>
_html<br>
_json<br>
_sql